tutorials/viscoelastic/viscoelasticFluidFoam/Leonov/constant/viscoelasticProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viscoelasticProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
5.0 wt.% solution of polyisobutylene in tetradecane
*/

rheology
{
                type Leonov;
                rho              rho [1 -3 0 0 0 0 0] 803.87097;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.002;
                etaP             etaP [1 -1 -1 0 0 0 0] 1.422;
                lambda           lambda [0 0 1 0 0 0 0] 0.03;

}

// ************************************************************************* //
